posts/reading_qip_papers/index.html
<!DOCTYPE html>
<html prefix="" lang="en">
<head>
<meta charset="utf-8">
<meta name="description" content="QIP2020 was the opportunity to catch-up with recent advances in quantum information processing, and select the papers and topics that I absolutely wanted to know more about. This post summarizes reading E. Tang's dequantization's paper, and H.-Y. Huang + R. Kueng's classical shadow technique for predicting features of quantum states with few measurements.">
<meta name="viewport" content="width=device-width">
<title>Reading QIP's papers (Part I) | Qoherences</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://h-oll.github.io/qoherences/posts/reading_qip_papers/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Harold Ollivier">
<meta property="og:site_name" content="Qoherences">
<meta property="og:title" content="Reading QIP's papers (Part I)">
<meta property="og:url" content="https://h-oll.github.io/qoherences/posts/reading_qip_papers/">
<meta property="og:description" content="QIP2020 was the opportunity to catch-up with recent advances in quantum information processing, and select the papers and topics that I absolutely wanted to know more about. This post summarizes readi">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2020-01-18T06:27:30+01:00">
</head>
<body>
    

    <header id="header" class="navbar"><div class="container">
            
    <div class="brand">

        <div class="brand-text">
            <a href="https://h-oll.github.io/qoherences/" title="Qoherences" rel="home">
                Qoherences
            </a>
        </div>

        <a id="btn-toggle-nav" class="navbar-toggle">
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
        </a>
    </div>

            
    <nav class="navbar-collapse collapse"><ul class="nav">
<li><a href="../../archive.html">Archive</a></li>
                <li><a href="../../categories/">Tags</a></li>
                <li><a href="../../rss.xml">RSS feed</a></li>
    
    
    </ul></nav>
</div>
    </header><div class="header-padding"> </div>

    
    <div class="post-header">
        <div class="container">
            <div class="title">
                Reading QIP's papers (Part I)
            </div>
        </div>
    </div>

    <div class="post-meta">
      <div class="container">
	<div class="meta clearfix">
	  <div class="authordate">
	    <time class="timeago" datetime="2020-01-18T06:27:30+01:00">2020/01/18</time>
	    

	    
          |  
        <a href="index.org" id="sourcelink">Source</a>

	  </div>
	  <div class="post-tags">
	  </div>
	</div>
      </div>
    </div>


    <div id="post-main" class="main">
        <div class="container">
        <div id="outline-container-org7900f4e" class="outline-2">
<h2 id="org7900f4e">Dequantizing quantum machine learning</h2>
<div class="outline-text-2" id="text-org7900f4e">
<p>
One of the highlights of QIP2020 was Ewin Tang's presentation of her dequantization technique. It was an overview of the work she has been doing since july 2018. I would highly recommend her blog <a href="https://ewintang.com/blog/2019/01/28/an-overview-of-quantum-inspired-sampling/">post</a> as a first introduction. 
</p>

<p>
To summarize the topic even further, till then, QML had access to an unfair assumption (efficient state vector preparation from classical data). The first part of Ewin Tang's work is to find the proper definition of a similar and comparable assumption for classical problems which is called "sample-query". Then she shows that under such assumption, you can perform 3 subroutines efficiently:
</p>
<ul class="org-ul">
<li>inner product of two complex vectors</li>
<li>thin matrix-vector simulation</li>
<li>low-rank approximation of a matrix</li>
</ul>
<p>
This makes the core of her work: within the sample-query assumption, you can perform randomized numerical linear algebra efficiently. 
</p>

<p>
The rest follows by replacing in quantum algorithms access to quantum evolution and sampling by the efficient classical subroutines above. This applies to supervised clustering, recommendation systems and low-rank matrix inversion.
</p>
</div>
</div>

<div id="outline-container-org79daaba" class="outline-2">
<h2 id="org79daaba">Predicting features of quantum systems from very few measurements</h2>
<div class="outline-text-2" id="text-org79daaba">
<p>
When we want to verify that an experiment worked the way it was supposed to, the usual approach is to perform state tomography. This means measuring a complete set of observables, estimate each of them accurately and reconstructing the quantum state from there. While this sounds very natural, it is usually overkill for what we <b>really</b> want to do. 
</p>

<p>
In fact, nmost of the time, we are interested not in the actual state of the quantum system, but only in predicting the outcome of certain measurements on this system. This happens when we can estimate the fidelity of the state to another pure state to show that the experiment produced almost the state is was supposed to produce. In such case, once we know that the state vector is almost at the right position, because the density matrix is positive semi definite and with trace 1, it's not  necessary to measure the other coefficients of the matrix anymore. We know they are small. 
</p>

<p>
There are various ways of optimizing the number of measurements to perform these kind of tasks. The one presented in this <a href="https://arxiv.org/abs/1908.08909">paper</a> works in the following way: 
</p>
<ol class="org-ol">
<li>Realize that measuring your state in the computational basis after applying to it a random Clifford circuit is equivalent to perform the POVM where each POVM element is a projector onto a stabilizer state.</li>
<li>The stabilizer states form a 3-design, i.e they can evaluate exactly any probability measure on the \(n\) qubit pure states up to the third moment.</li>
</ol>
<p>
1 and 2 give that if the POVM element associated to the stabilizer state \(|s\rangle\) was obtained in the measurement, \(\hat \rho = (2^n+1) |s\rangle\langle s| - Id\) is a good estimator of \(\text{tr}(O\rho)\) where \(O\) is hermitian.
</p>

<p>
Now, we get a good convergence by repeating these measurements \(N\) times and using median of means estimation.
</p>

<p>
The main theorem then follows: 
</p>

<p>
Suppose \(\rho\) is the state of a system composed of \(n\) qubits. Take \(N\) copies of this system. Fix \(\{O_i\}_{i\ in \[M\]}\) be \(M\) hermitian matrices of size \(2^n \times 2^n\). Set \(\epsilon\) and \(\delta\) in \(\[0,1\]\). Then \(N = 204 \log(2M/\delta) \max_i \tr(O_i^2)/\epsilon^2\) is sufficient to predict all function evaluations of \(\tr O_i\rho\) within \(\epsilon\) with probability at least \(1-\delta\) via measurement of random clifford circuits and median of means estimation. 
</p>
</div>
</div>
            
        
        <div id="disqus_thread"></div>
        <script>
        var disqus_shortname ="qoherences",
            disqus_url="https://h-oll.github.io/qoherences/posts/reading_qip_papers/",
        disqus_title="Reading QIP's papers (Part I)",
        disqus_identifier="cache/posts/reading_qip_papers.html",
        disqus_config = function () {
            this.language = "en";
        };
        (function() {
            var dsq = document.createElement('script'); dsq.async = true;
            dsq.src = 'https://' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script><noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a>
</noscript>
    <a href="https://disqus.com" class="dsq-brlink" rel="nofollow">Comments powered by <span class="logo-disqus">Disqus</span></a>


        

        </div>
    </div>

    
    <footer><div class="container">
            <div class="social">



                <div class="social-entry">
                    <a href="../../rss.xml" target="_blank">
                        <i class="fa fa-rss"></i> 
                    </a>
                </div>
            </div>
                <div class="copyright">
                    Contents © 2021         <a href="mailto:harold.ollivier@linksights.io">Harold Ollivier</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
                    
                </div>
           
        </div>
    </footer><!-- Global site tag (gtag.js) - Google Analytics --><script async src="https://www.googletagmanager.com/gtag/js?id=UA-150665042-1"></script><script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'UA-150665042-1');
</script><script src="../../assets/js/all-nocdn.js" type="text/javascript"></script>
</body>
</html>
